Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicTagAttributes.TagContent Property
 The tag content.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ContainerElement TagContent { get; set; }
Public Property TagContent As ContainerElement
	Get
	Set
Property Value
Type: ContainerElement
See Also
Reference
ViewMarkBasicTagAttributes Class
Tekla.Structures.Drawing Namespace